
__author__ = 'Дьякова Елизавета Сергеевна'

# Задача-1: Ввести ваше имя и возраст в отдельные переменные,
# вычесть из возраста 18 и вывести на экран в следующем виде:
# "Василий на 2 года/лет больше 18"
# по желанию сделать адаптивный вывод, то есть "на 5 лет больше", "на 3 года меньше" и.т.д.

name = input("Введите Ваше имя ")
age = int(input("Введите Ваш возраст "))
diff = age - 18
ost = diff % 10
if diff < 0:
	if diff == 1:
		print(name, "  на ", diff, " год меньше 18")
	elif diff == 2 or diff == 3 or diff == 4:
		print(name, "  на ", abs(diff), " года меньше 18")
	else:
		print(name, "  на ", abs(diff), " лет меньше 18")
elif diff == 0:
	print("Возраст ", name, " равен 18")
elif diff > 20:
	if ost == 1:
		print(name, "  на ", diff, " год больше 18")
	elif ost == 2 or ost == 3 or ost == 4:
		print(name, "  на ", diff, " года больше 18")
	else:
		print(name, "  на ", diff, " лет больше 18")
else:
	if diff == 1:
	    print(name, "  на ", diff, " год меньше 18")
	elif diff == 2 or diff == 3 or diff == 4:
		print(name, "  на ", diff, " года больше 18")
	else:
		print(name, "  на ", diff, " лет больше 18")


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

first = input("Введите первое число ")
second = input("Введите второе число ")
print("До преобразования: \nЗначение первое: ", first, "\nЗначение второе: ", second)
first, second = second, first
print("После преобразования: \nЗначение первое: ", first, "\nЗначение второе: ", second)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4


import math
print("Дано уравнение ax² + bx + c = 0 \nВведите a, b, c")
a = float(input("a = "))
b = float(input("b = "))
c = float(input("c = "))
d = b ** 2 - 4 * a * c
print("Дискриминант равен ", round(d, 2))
if d > 0:
	x1 = (-b + math.sqrt(d)) / (2 * a)
	x2 = (-b - math.sqrt(d)) / (2 * a)
	print("x1 = ", round(x1, 2), "\nx2 = ", round(x2, 2))
elif d == 0:
	x = -b / (2 * a)
	print("x = ", round(x, 2))
else:
	print("Нет корней")